{
  "about": {
    "hello": "Hello there! I'm pleased you discovered my profile.",
    "up": "My past experiences as an urban planner have exposed me to the challenges of numerous large-scale projects, enhancing my skills in design and project management.",
    "curr": "Presently, I am dedicated to harnessing computer technology to empower businesses, aspiring to facilitate a more enriched and smarter lifestyle. As a developer and former designer, I hope to bring a unique blend of skills driven by curiosity, rapid learning."
  },

  "hobbies": [
    {
      "name": "Cycling",
      "icon": "fa-person-biking"
    },
    {
      "name": "Skiing",
      "icon": "fa-skiing"
    },
    {
      "name": "Cat lover",
      "icon": "fa-cat"
    },
    {
      "name": "Music",
      "icon": "fa-music"
    },
    {
      "name": "Awareness",
      "icon": "fa-heart-pulse"
    }
  ],
  "skills": [
    {
      "name": "Front-End Development",
      "icon": "fa-brands fa-react",
      "description": "Proficient in utilizing framework like React and Bootstrap to develop high-quality, responsive webpages. Experience with Typescript to ensure robust development."
    },
    {
      "name": "Back-End Development",
      "icon": "fa-brands fa-node",
      "description": "Skilled in Node.js, Express.js, PostgreSQL (including Supabase) and MySQL. Capable of building RESTful APIs and conducting testing using Postman."
    },
    {
      "name": "Agile Development",
      "icon": "fas fa-rocket",
      "description": "Familiar with and recognise Agile development and Scrum methodologies."
    },
    {
      "name": "Version Control",
      "icon": "fa-solid fa-code-branch",
      "description": "Experienced in using Git and GitHub for collaboration and version control."
    },
    {
      "name": "Engineering Drawing",
      "icon": "fa-compass-drafting",
      "description": "Proficient in creating engineering-style diagrams using AutoCAD and relevant plugins."
    },
    {
      "name": "Graphic Design",
      "icon": "fa-layer-group",
      "description": "Proficient in Adobe Photoshop, Illustrator, and InDesign for content layout and the creation of high-quality analysis diagrams."
    },
    {
      "name": "Modelling & Rendering",
      "icon": "fa-cubes",
      "description": "Using SketchUp to create detailed 3D digital models and rendering with V-Ray/Lumion."
    },
    {
      "name": "Report Writing",
      "icon": "fa-solid fa-file-powerpoint",
      "description": "Skillful in Markdown and PowerPoint for effective and high quality presentation design."
    }
  ],
  "experience": [ {
    "company": "Don Dunstan Foundation",
    "position": "Graduate Designer Volunteer",
    "website": "https://www.dunstan.org.au/",
    "startDate": "2024-03-10",
    "endDate": "2024-05-10",
    "summary": "Collaborated with the Don Dunstan Foundation to organize, compile, and format the 2023 Annual Report. Worked closely with clients to understand and translate design requirements into creative and impactful visual solutions."
  },
    {
      "company": "The University of Adelaide",
      "position": "Master of Computing and Innovation",
      "website": "https://www.adelaide.edu.au/degree-finder/mcomi_mcompinnov.html",
      "startDate": "2022-07-24",
      "endDate": "2024-07-10",
      "summary": "I have maintained a weighted average mark(WAM) of 91/100 (GPA 6.75/7.0) across all my non-business courses, covering various algorithmic courses, operating systems, artificial intelligence, and others. My WAM for all completed courses stands at 87/100 (GPA 6.5/7.0)"
    },
    {
      "company": "Atkins",
      "position": "Urban Planner/Project Manager",
      "website": "https://www.atkinsrealis.com/",
      "startDate": "2016-07-14",
      "endDate": "2022-07-10",
      "summary": "With over 6 years of experience in leading urban planning projects, I have actively contributed to 20+ large-scale urban development and consultancy initiatives. In addition to technical responsibilities, I have taken on a role in project management, overseeing tasks such as coordinating team members, conducting initial financial plan, and managing communication across various levels."
    },
    {
      "company": "Atkins",
      "position": "Project Planner Intern",
      "website": "https://www.atkinsrealis.com/",
      "startDate": "2015-11-14",
      "endDate": "2016-02-10",
      "summary": "Contributed as a key member of the planning team involved in securing a project, won against Surbana Jurong Group and Boston Consulting Group (BCG)."
    },
    {
      "company": "Beijing University of Civil Engineering and Architecture",
      "position": "Bachelor of Engineering in Urban Planning",
      "website": "https://english.bucea.edu.cn/",
      "startDate": "2011-09-01",
      "endDate": "2016-07-01",
      "summary": "A robust five-year program designed to cultivate professionals in the fields of architecture, urban planning, and its surrounding disciplines. Average grade: 86/100"
    }
  ]
}
